# Missing values anlysis

- Missing values anlysis is very important in data analysis

- It is quite natural data set ha missing values 

- There are so many techniques are there

    - Mean
     
    - Median

    - mode 
    
    - bfill
   
    - fill
    
    - pad
    
    - random values
    
    - you can compare column values and impute
    
    - KNN imputer

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
dict1={"Name" : ["Ram","Syam",'Krish',np.nan],
      "Ages" : [30,32,np.nan,34],
      "City": [np.nan, "Hyd","Pune","Chennai"]}
d1=pd.DataFrame(dict1)
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish   NaN     Pune
3    NaN  34.0  Chennai

In [3]:
d1.isnull()

    Name   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [4]:
d1.isnull().sum()

Name    1
Ages    1
City    1
dtype: int64

In [6]:
dict1={"Name" : ["Ram","Syam",'Krish','null'],
      "Ages" : [30,32,'null',34],
      "City": ['null', "Hyd","Pune","Chennai"]}
d2=pd.DataFrame(dict1)
d2

    Name  Ages     City
0    Ram    30     null
1   Syam    32      Hyd
2  Krish  null     Pune
3   null    34  Chennai

In [9]:
dict1={"Name" : ["Ram","Syam",'Krish',None],
      "Ages" : [30,32,None,34],
      "City": [None, "Hyd","Pune","Chennai"]}
d3=pd.DataFrame(dict1)
d3

    Name  Ages     City
0    Ram  30.0     None
1   Syam  32.0      Hyd
2  Krish   NaN     Pune
3   None  34.0  Chennai

In [10]:
d3.isnull()

    Name   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [11]:
d3.isnull().sum()

Name    1
Ages    1
City    1
dtype: int64

- np.nan is working

- None is working 
  
  - None is taken for numerical values as Nan 
  
  - and the categorical column none is there 
  
  - but both are conider as NAN  

- null is not working

# Method-1  Random Fill

In [12]:
d1.fillna(30,inplace=True)
d1

    Name  Ages     City
0    Ram  30.0       30
1   Syam  32.0      Hyd
2  Krish  30.0     Pune
3     30  34.0  Chennai

In [14]:
d1.dtypes

Name     object
Ages    float64
City     object
dtype: object

- In the above dataframe the 30 is converted into categorical for city column 

- and the Name column also 

- and it is converted to float for the ages

In [15]:
dict1={"Name" : ["Ram","Syam",'Krish',np.nan],
      "Ages" : [30,32,np.nan,34],
      "City": [np.nan, "Hyd","Pune","Chennai"]}
d1=pd.DataFrame(dict1)
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish   NaN     Pune
3    NaN  34.0  Chennai

# Method -2

**Fill for a specific column**

In [17]:
d1["Ages"].fillna(30,inplace=True)
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish  30.0     Pune
3    NaN  34.0  Chennai

# Method-3

- Mean

- Median

- Mode

In [18]:
dict1={"Name" : ["Ram","Syam",'Krish',np.nan],
      "Ages" : [30,32,np.nan,34],
      "City": [np.nan, "Hyd","Pune","Chennai"]}
d1=pd.DataFrame(dict1)
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish   NaN     Pune
3    NaN  34.0  Chennai

- Median does not affect by outliers 

- Mean affect by outliers

- If you have a data 

    - First check the outliers 
    
    - You can check with created outlier function 
    
    - If you feel outliers are there 
    
    - Then fill missing values with median

In [20]:
# Calculate mean
age_mean=d1["Ages"].mean()
age_mean

32.0

In [21]:
d1["Ages"].fillna(age_mean,inplace=True)
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish  32.0     Pune
3    NaN  34.0  Chennai

In [25]:
name_mode=d1["Name"].mode()
d1["Name"].fillna(name_mode,inplace=True)     # Not possible for catgegorical columns
name_mode

0    Krish
1      Ram
2     Syam
Name: Name, dtype: object

# Method-4

- pad

- bfill

- ffill

- backfill

In [26]:
# again read the data
dict1={"Name" : ["Ram","Syam",'Krish',np.nan],
      "Ages" : [30,32,np.nan,34],
      "City": [np.nan, "Hyd","Pune","Chennai"]}
d1=pd.DataFrame(dict1)
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish   NaN     Pune
3    NaN  34.0  Chennai

In [27]:
d1.fillna(method='pad')   # The Nan value copies the previous value using column value

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish  32.0     Pune
3  Krish  34.0  Chennai

In [28]:
d1.fillna(method='pad',axis=1)  # The Nan value copies the previous value using row values

    Name   Ages     City
0    Ram   30.0     30.0
1   Syam   32.0      Hyd
2  Krish  Krish     Pune
3    NaN   34.0  Chennai

In [29]:
d1.fillna(method='pad',axis=0)    # 0 is defaultly takes

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish  32.0     Pune
3  Krish  34.0  Chennai

In [30]:
d1

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish   NaN     Pune
3    NaN  34.0  Chennai

In [31]:
d1.fillna(method='bfill')  # The Nan value copies the after value using column value

    Name  Ages     City
0    Ram  30.0      Hyd
1   Syam  32.0      Hyd
2  Krish  34.0     Pune
3    NaN  34.0  Chennai

In [36]:
d1.fillna(method='bfill',axis = 0)

    Name  Ages     City
0    Ram  30.0      Hyd
1   Syam  32.0      Hyd
2  Krish  34.0     Pune
3    NaN  34.0  Chennai

In [35]:
 d1.fillna(method='bfill',axis=1)  # The Nan value copies the after value using row value

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish  Pune     Pune
3   34.0  34.0  Chennai

In [37]:
d1.fillna(method='ffill')     # ffill and pad are similar

    Name  Ages     City
0    Ram  30.0      NaN
1   Syam  32.0      Hyd
2  Krish  32.0     Pune
3  Krish  34.0  Chennai

In [38]:
d1.fillna(method='ffill',axis=1)

    Name   Ages     City
0    Ram   30.0     30.0
1   Syam   32.0      Hyd
2  Krish  Krish     Pune
3    NaN   34.0  Chennai

In [39]:
d1.fillna(method='backfill')      # bfill and backfill are same

    Name  Ages     City
0    Ram  30.0      Hyd
1   Syam  32.0      Hyd
2  Krish  34.0     Pune
3    NaN  34.0  Chennai

- pad and ffill both are same

- bfill and backfill both are same

# Categorical columns

- Categorical columns mainly does not have any meaning in dataframe

- If it is some text or sentence you can find the meaning of the sentence

- For example Names colum is there , Review column is there

- Because of only Name it self you cant judge the output

- But a Review can impact the output

- Generally if any naive kind of columns we can fill in any way

- But if some columns impacting output, Yes we need to fill those columns with an idea how that columns related to other 
  columns

# Method -5

**KNN imputer**

KNN= K- Nearest Neighbours 

- IT is one of ML model to find the nearest solution based distance metric 

- Instead of taking all the values of mean

- Why can't we take neighbours mean of the observation

- Here first will chooe the neighbours 

- IT will calculate mean of those neighbours and fill with that value

**Package name** : Sklearn.impute

**Method name** : KnnImputer



- Test with numerical column 

- Test with categorical+Numerical

In [8]:
dict1={"Name" : ["Ram","Syam",'Krish',np.nan,"Surya","Pradeep","Raj"],
      "Ages" : [30,32,np.nan,34,np.nan,27,29],
      "City": [np.nan, "Hyd","Pune","Chennai","Benguluru",np.nan,"Delhi"]}
d1=pd.DataFrame(dict1)
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
d1["Ages"]=knn.fit_transform(d1[["Ages"]])
d1["Ages"]

0    30.0
1    32.0
2    30.4
3    34.0
4    30.4
5    27.0
6    29.0
Name: Ages, dtype: float64